Tekla Open API Reference for Tekla Structures 2025
Assertion Constructor
 Initializes a new instance of the Assertion class.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Assertion(
	string message,
	string detailedMessage,
	string methodName
)
Public Sub New (
	message As String,
	detailedMessage As String,
	methodName As String
)
Parameters
message
Type: System.String
 The message.
detailedMessage
Type: System.String
 The detailed message.
methodName
Type: System.String
 The method name.
Exceptions
Exception | Condition
ArgumentNullException
See Also
Reference
Assertion Class
Tekla.Structures Namespace